[M_IrisHUB_SmackTalk MissionDefinition]
TurnInDescription="The contents of these interviews should convince the other gladiators that A) you're a force to be reckoned with, and B) your trainer is really weird."
MissionSummary="Collect ECHO Recorders in the [place]Badass Crater of Badassitude[-place]"
